# ChangeTypeId Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Element..::..ChangeTypeId Method
Element Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ChangeTypeId(ElementId) | Changes the type of the element. |
| ChangeTypeId(Document, ICollection<(Of <<'(ElementId>)>>), ElementId) | Changes the type of all elements in the given set. |

# See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace